//  -- 1 --
// У вас є масив об’єктів fruts, і в кожному з них є name
// Напишіть код, який перетворює їх в масив імен.

// const fruts = [
//   { id: 0, name: "Apple" },
//   { id: 1, name: "Tomat" },
//   { id: 2, name: "Cherry" },
//   { id: 3, name: "Orange" },
// ];

// const fruts = ["Apple", "Tomat", "Cherry", "Orange"];

//  -- 2 --
//Виведіть парні числа від 2 до 10, використовуючи цикл for.

// for (let d = 1; d <= 10; d++) {
//   if (d % 2) continue;
//   console.log(d);
// }

//  -- 3 --
// Замініть цикл "for" на "while"
// for (let i = 0; i < 5; i++) {
//   console.log(`цифра ${i}!`);
// }

// let d = 0;
// while (d < 5) {
//   d++;
//   console.log(`цифра ${d}!`);
// }

//  -- 4 --
//Напишіть цикл, який пропонує prompt ввести число більше за 100.
//Якщо відвідувач введе менше число – попросити ввести ще раз, і так далі.
//Цикл повинен запитувати число доти, доки відвідувач не введе число,
// більше за 100, або не скасує ввід/введе порожній рядок.

// let d = 0;

// while (d < 100) {
//   let d = prompt("Введіть число більше 100");
//   if (d > 100 || d === null || d == "") break;
// }

//  -- 5 --
// Вирахуйте середній вік

// const girls = [
//   { age: 23, name: "Оля" },
//   { age: 29, name: "Аня" },
//   { age: 10, name: "Юля" },
//   { age: 20, name: "Катя" },
// ];

// sum = 0;
// for (let d = 0; d < girls.length; d++) {
//   sum = sum + girls[d].age / girls.length;
// }

// console.log(sum);
